# NoSwapGroupBeingEdited Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..NoSwapGroupBeingEdited Property
BuiltInFailures..::..GroupFailures Class See Also
---
You may not change the type of the group that is currently being edited.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoSwapGroupBeingEdited { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoSwapGroupBeingEdited As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoSwapGroupBeingEdited {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace